Revit 2027 API
InCanvasControlData Properties
The InCanvasControlData type exposes the following members.
Properties
Name | Description
ImagePath |  The path to the image file to be used. This must be an absolute path to a location on disk.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Position |  The position of the in-canvas control in model coordinates.
Top
See Also
Reference
InCanvasControlData Class
Autodesk.Revit.DB Namespace